app/views/checks/index.html.erb

SELECT `checks`.* FROM `checks`
---
      <% query = {'host' => check.check_hostname, 'type' => 'http'} %>
      <% response = HTTParty.get('https://api.pingdom.com/api/2.0/checks/'+ check.check_id.to_s, headers: {"app-key" => "2j7igy6801oc1cw1yrm0xyozbsmx9p97"}, :basic_auth => auth, :query => query).body %>