app/controllers/checks_controller.rb

SELECT `checks`.* FROM `checks`
---
  def index
    @checks = Check.all

INSERT INTO `checks` (`check_name`, `check_hostname`, `user_id`, `created_at`, `updated_at`) VALUES ('Devour Natasha', 'devourgoodfood.com', 1, '2016-01-15 05:17:52', '2016-01-15 05:17:52')
UPDATE `checks` SET `check_id` = 0, `updated_at` = '2016-01-15 04:50:02' WHERE `checks`.`id` = 18
UPDATE `users` SET `last_request_at` = '2016-01-15 04:12:44', `updated_at` = '2016-01-15 04:12:44' WHERE `users`.`id` = 1
---
  def create
    @check = Check.create(check_name: params[:check_name], check_hostname: params[:check_hostname], user_id: current_user.id)
    url_check_name = params[:check_name]
    url_hostname = params[:check_hostname]

    auth = {:username => 'stuff@logi-tek.net', :password => 'tina2000'}
    query = {'host' => @check.check_hostname, 'type' => 'http'}
    response = HTTParty.post('https://api.pingdom.com/api/2.0/checks?name=' + url_check_name + '&host=' + url_hostname + '&type=http', headers: {"app-key" => "2j7igy6801oc1cw1yrm0xyozbsmx9p97"}, :basic_auth => auth, :query => query).body
    post_response = JSON.parse(response).to_h

    grabbed_check_id = post_response["check"]["id"]
    p grabbed_check_id
    @check.update(check_id: grabbed_check_id)

SELECT  `checks`.* FROM `checks` WHERE `checks`.`id` = 1 LIMIT 1
---
  def show
    @check = Check.find(params[:id])

SELECT  `checks`.* FROM `checks` WHERE `checks`.`id` = 22 LIMIT 1
DELETE FROM `checks` WHERE `checks`.`id` = 22
---
  def destroy
    @check = Check.find_by(id: params[:id])
    auth = {:username => 'stuff@logi-tek.net', :password => 'tina2000'}
    query = {'host' => @check.check_hostname, 'type' => 'http'}
    response = HTTParty.delete('https://api.pingdom.com/api/2.0/checks/' + @check.check_id.to_s, headers: {"app-key" => "2j7igy6801oc1cw1yrm0xyozbsmx9p97"}, :basic_auth => auth, :query => query).body